<?php

namespace theme\thumbnail;
use Helper as help;

call_user_func(function(){

	// =========================================================================
	// サムネイルサイズ追加
	// =========================================================================
	$img_sizes = array(
	);
	foreach($img_sizes as $k => $v){
		if(!isset($v[2])) $v[2] = false;
		// $v[2] = $v[2] ? $v[2] : false;
		add_image_size($k,$v[0],$v[1],$v[2]);
	}

	// =========================================================================
	// 投稿タイプごとにサムネイルサイズ除外
	// =========================================================================
	//function save_custom_data(){
	//	$post_type = get_post_type();
	//	switch($post_type){
	//		// -----------------------------------------------------------------
	//		// インタビュー
	//		// -----------------------------------------------------------------
	//		case 'interview_post' :
	//			add_image_size('test-img',0,0);
	//		break;
	//	}
	//}
	//add_action('save_post','save_custom_data');

});
